app/controllers/students_controller.rb

SELECT "students".* FROM "students"
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2018-10-16 19:49:52.739359"], ["updated_at", "2018-10-16 19:49:52.739359"]]
---
  def create
  # byebug
  @student = Student.new
  @student.first_name = params[:student][:first_name]
  @student.last_name = params[:student][:last_name]
  @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "tiff"], ["last_name", "nguyen"], ["updated_at", "2018-10-16 20:54:48.967529"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(first_name: params[:student][:first_name],last_name: params[:student][:last_name])